[
  {
    "rating": 1,
    "reviewer_name": "iqwan",
    "reviewer_name_normalized": "iqwan",
    "review_text": "Pengiriman sangat lama. Walaupun diluar pihak penjual, tetapi ini mempengaruhi pelayanan terjadap konsumen, sehingga saya merasa kurang puas belanja disini. Meskipun barang bagus.",
    "review_text_normalized": "pengiriman sangat lama walaupun diluar pihak penjual tetapi ini mempengaruhi pelayanan terjadap konsumen sehingga saya merasa kurang puas belanja disini meskipun barang bagus",
    "review_date": "9 bulan lalu",
    "review_date_normalized": "9 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 1,
    "scraped_at": "2025-07-16 22:33:55"
  },
  {
    "rating": 1,
    "reviewer_name": "A***l",
    "reviewer_name_normalized": "A l",
    "review_text": "segini banget packingannya,untung isinya aman gak tercecer di jalan..ngerii ngeri pake kurir rekomendasi. dari awal juga nda ada pilihan packing kayunya. semoga matepadnya gak ada masalah nanti",
    "review_text_normalized": "segini banget packingannya untung isinya aman gak tercecer di jalan ngerii ngeri pake kurir rekomendasi dari awal juga nda ada pilihan packing kayunya semoga matepadnya gak ada masalah nanti",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 1,
    "scraped_at": "2025-07-16 22:34:00"
  },
  {
    "rating": 1,
    "reviewer_name": "c***i",
    "reviewer_name_normalized": "c i",
    "review_text": "keyboard mati, masa cuman gara2 barang harus PO dlu terus barang gak di cek kualitas sih? sudah ke service center jga tetap mati, di janjikan ganti unit tapi gak tau sampai kapan, tidak ada kpastian. kalo lama dan gak dapet apa dari kesalahan hwaweinya, fix kapok sih beli lagi productnya review bisa di ganti bintang bisa bertambah, tapi masa cuman dapat kata maaf",
    "review_text_normalized": "keyboard mati masa cuman gara2 barang harus po dlu terus barang gak di cek kualitas sih sudah ke service center jga tetap mati di janjikan ganti unit tapi gak tau sampai kapan tidak ada kpastian kalo lama dan gak dapet apa dari kesalahan hwaweinya fix kapok sih beli lagi productnya review bisa di ganti bintang bisa bertambah tapi masa cuman dapat kata maaf",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 1,
    "scraped_at": "2025-07-16 22:34:05"
  },
  {
    "rating": 1,
    "reviewer_name": "Johanes",
    "reviewer_name_normalized": "Johanes",
    "review_text": "HUAWEI it self a good brand and quality, unfortunately the person behind huawei online via tokopedia, is able to change the specification bonus without prior notice. First of all, we put product in basket, at that time still with bonus pencil, then time to buy coming and surprisingly, the pen is gone, without prior notice. So we receive only product without pencil. So, the way admin can change the bonus spec so sudenly, and without thinking impact to the Brand. I'm very disapointed. Hopefully Huawei International can read this, and giving a proper training to your sales online team. They are being paid by you but they are careless.",
    "review_text_normalized": "huawei it self a good brand and quality unfortunately the person behind huawei online via tokopedia is able to change the specification bonus without prior notice first of all we put product in basket at that time still with bonus pencil then time to buy coming and surprisingly the pen is gone without prior notice so we receive only product without pencil so the way admin can change the bonus spec so sudenly and without thinking impact to the brand i m very disapointed hopefully huawei international can read this and giving a proper training to your sales online team they are being paid by you but they are careless",
    "review_date": "11 bulan lalu",
    "review_date_normalized": "11 bulan lalu",
    "variant": "Violet + EWS",
    "variant_normalized": "Violet EWS",
    "rating_filter": 1,
    "scraped_at": "2025-07-16 22:34:11"
  },
  {
    "rating": 1,
    "reviewer_name": "J***h",
    "reviewer_name_normalized": "J h",
    "review_text": "Ga kepake, ngga compatible dgn banyak platform, mau google meet aja gabisa. Semua harus download apps non official jd trust issues dgn keamanan. Pdhal build produknya bagus banget. Dari beli sd skrg ga pernah bener2 dipake...  kasih ke anak buat nonton YT atau main Roblox aja banyak glitchnya gara2 cuma bisa pake browser atau apk ga resmi. Oya... kualitas browser bawaaannya.... Ampuuuuun parah banget!",
    "review_text_normalized": "ga kepake ngga compatible dgn banyak platform mau google meet aja gabisa semua harus download apps non official jd trust issues dgn keamanan pdhal build produknya bagus banget dari beli sd skrg ga pernah bener2 dipake kasih ke anak buat nonton yt atau main roblox aja banyak glitchnya gara2 cuma bisa pake browser atau apk ga resmi oya kualitas browser bawaaannya ampuuuuun parah banget",
    "review_date": "9 bulan lalu",
    "review_date_normalized": "9 bulan lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 1,
    "scraped_at": "2025-07-16 22:34:16"
  },
  {
    "rating": 1,
    "reviewer_name": "d***g",
    "reviewer_name_normalized": "d g",
    "review_text": "pengiriman lama... pelayanan cs kaya ****** packing nya hancur, untung barang aman... saya harus mencari barang nya di bbrp counter di jakarta dan semarang karena barang sudah hilang entah kemana selama 1 bulan lebih. dan cs hanya bisa maaf mohon sabar menunggu. sabar menunggu sudah 1 bulan sampai harus cari bbrp counter di jakarta dan semarang.",
    "review_text_normalized": "pengiriman lama pelayanan cs kaya packing nya hancur untung barang aman saya harus mencari barang nya di bbrp counter di jakarta dan semarang karena barang sudah hilang entah kemana selama bulan lebih dan cs hanya bisa maaf mohon sabar menunggu sabar menunggu sudah bulan sampai harus cari bbrp counter di jakarta dan semarang",
    "review_date": "11 bulan lalu",
    "review_date_normalized": "11 bulan lalu",
    "variant": "Spcae Grey+EWS",
    "variant_normalized": "Spcae Grey EWS",
    "rating_filter": 1,
    "scraped_at": "2025-07-16 22:34:21"
  },
  {
    "rating": 1,
    "reviewer_name": "Kurniawan",
    "reviewer_name_normalized": "Kurniawan",
    "review_text": "Gak dapat m pencil, dalih promo berubah-ubah",
    "review_text_normalized": "gak dapat m pencil dalih promo berubah ubah",
    "review_date": "8 bulan lalu",
    "review_date_normalized": "8 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 1,
    "scraped_at": "2025-07-16 22:34:23"
  },
  {
    "rating": 1,
    "reviewer_name": "Andre",
    "reviewer_name_normalized": "Andre",
    "review_text": "Tidak sesuai deskripsi.chat awal akn diberi keyboard + m pencil.Stlh dikirim,tdk ad m pencil-nya.Saat ditanya \"Kenapa tdk ad m pencil-nya?\" Katanya: kosong.Penjual tdk bertanggung jawab.Tdk sesuai kesepakatan + informasi awal.Promo berubah-ubah",
    "review_text_normalized": "tidak sesuai deskripsi chat awal akn diberi keyboard m pencil stlh dikirim tdk ad m pencil nya saat ditanya kenapa tdk ad m pencil nya katanya kosong penjual tdk bertanggung jawab tdk sesuai kesepakatan informasi awal promo berubah ubah",
    "review_date": "4 bulan lalu",
    "review_date_normalized": "4 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 1,
    "scraped_at": "2025-07-16 22:34:28"
  },
  {
    "rating": 1,
    "reviewer_name": "M***d",
    "reviewer_name_normalized": "M d",
    "review_text": "Kecewa, barang tidak terkirim dan hilang, tapi saya tidak mendapat penggantian atas asuransi pengiriman.",
    "review_text_normalized": "kecewa barang tidak terkirim dan hilang tapi saya tidak mendapat penggantian atas asuransi pengiriman",
    "review_date": "9 bulan lalu",
    "review_date_normalized": "9 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 1,
    "scraped_at": "2025-07-16 22:34:30"
  },
  {
    "rating": 1,
    "reviewer_name": "Nabil",
    "reviewer_name_normalized": "Nabil",
    "review_text": "12 bulan lalu\nNabil\nVarian: Violet + EWS\nKendala: Tidak lengkap/salah kirim\n4 orang terbantu\nLihat Balasan",
    "review_text_normalized": "bulan lalu nabil varian violet ews kendala tidak lengkap salah kirim orang terbantu lihat balasan",
    "review_date": "12 bulan lalu",
    "review_date_normalized": "12 bulan lalu",
    "variant": "Violet + EWS",
    "variant_normalized": "Violet EWS",
    "rating_filter": 1,
    "scraped_at": "2025-07-16 22:34:31"
  },
  {
    "rating": 1,
    "reviewer_name": "R***n",
    "reviewer_name_normalized": "R n",
    "review_text": "10 bulan lalu\nR***n\nVarian: Space Grey\nKendala: Kemasan tidak aman\n2 orang terbantu\nLihat Balasan",
    "review_text_normalized": "bulan lalu r n varian space grey kendala kemasan tidak aman orang terbantu lihat balasan",
    "review_date": "10 bulan lalu",
    "review_date_normalized": "10 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 1,
    "scraped_at": "2025-07-16 22:34:43"
  },
  {
    "rating": 1,
    "reviewer_name": "Anwar",
    "reviewer_name_normalized": "Anwar",
    "review_text": "11 bulan lalu\nAnwar\nVarian: Space Grey\nKendala: Pelayanan penjual kurang\n2 orang terbantu\nLihat Balasan",
    "review_text_normalized": "bulan lalu anwar varian space grey kendala pelayanan penjual kurang orang terbantu lihat balasan",
    "review_date": "11 bulan lalu",
    "review_date_normalized": "11 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 1,
    "scraped_at": "2025-07-16 22:34:45"
  },
  {
    "rating": 2,
    "reviewer_name": "R***i",
    "reviewer_name_normalized": "R i",
    "review_text": "percuma PO benefits yg didapet sma ky yg setelah PO. kualitas packing barang kacau, parah ini bagian pengirimannya. klo barang diterima sampai rusak gimana?!",
    "review_text_normalized": "percuma po benefits yg didapet sma ky yg setelah po kualitas packing barang kacau parah ini bagian pengirimannya klo barang diterima sampai rusak gimana",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 2,
    "scraped_at": "2025-07-16 22:35:34"
  },
  {
    "rating": 2,
    "reviewer_name": "Syahier",
    "reviewer_name_normalized": "Syahier",
    "review_text": "rupanya dalam paket tidal termasuk Stylus Pen",
    "review_text_normalized": "rupanya dalam paket tidal termasuk stylus pen",
    "review_date": "7 bulan lalu",
    "review_date_normalized": "7 bulan lalu",
    "variant": "Spcae Grey+EWS",
    "variant_normalized": "Spcae Grey EWS",
    "rating_filter": 2,
    "scraped_at": "2025-07-16 22:35:35"
  },
  {
    "rating": 2,
    "reviewer_name": "Iman",
    "reviewer_name_normalized": "Iman",
    "review_text": "Kalau teknologi oke, tapi transparansi marketing dan after salesnya yang bermasalah. For information kalau beli bonus bundle pen dan keyboardnya, itu tidak termasuk garansi. Jadi setelah pakai sekitar 1 bulan, pen bermasalah (ga tau memang kualitas pen nya gen 3 ini jelek atau memang defect pabrik), bawa ke service center ga diterima. harus beli pen baru 1,4jt (kalau beli online 1,2an). Itupun di service center barang ga ready (SC huawei Kelapa Gading). Ya huawei harus lebih transparan masalah ini. Jangan sekedar gembar gembor bonus bundle include tapi syarat dan ketentuan ga dijelasin. untuk yg mau beli buat gambar, saya juga belum bisa nilai banyak karena saat tip hover sekitar 1cm dari layar dia udah register small stroke, jadi garisnya ga karuan kepencet ke mana2. Sebelum akhirnya mati total sama sekali (mungkin karena pen saya bermasalah ) Kalau memang kualitas pen gen-3 separah itu, saya jadi takut untuk replace beli pen baru. Padahal harusnya drawing pen itu masuk kelas ke barang yang tahan banting. Ga tau mungkin saya saja yang apes dapat barang defect.",
    "review_text_normalized": "kalau teknologi oke tapi transparansi marketing dan after salesnya yang bermasalah for information kalau beli bonus bundle pen dan keyboardnya itu tidak termasuk garansi jadi setelah pakai sekitar bulan pen bermasalah ga tau memang kualitas pen nya gen ini jelek atau memang defect pabrik bawa ke service center ga diterima harus beli pen baru 4jt kalau beli online 2an itupun di service center barang ga ready sc huawei kelapa gading ya huawei harus lebih transparan masalah ini jangan sekedar gembar gembor bonus bundle include tapi syarat dan ketentuan ga dijelasin untuk yg mau beli buat gambar saya juga belum bisa nilai banyak karena saat tip hover sekitar 1cm dari layar dia udah register small stroke jadi garisnya ga karuan kepencet ke mana2 sebelum akhirnya mati total sama sekali mungkin karena pen saya bermasalah kalau memang kualitas pen gen separah itu saya jadi takut untuk replace beli pen baru padahal harusnya drawing pen itu masuk kelas ke barang yang tahan banting ga tau mungkin saya saja yang apes dapat barang defect",
    "review_date": "11 bulan lalu",
    "review_date_normalized": "11 bulan lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 2,
    "scraped_at": "2025-07-16 22:35:41"
  },
  {
    "rating": 2,
    "reviewer_name": "A***y",
    "reviewer_name_normalized": "A y",
    "review_text": "Sorry harus kasih bintang 2 karena kurir ekspedisi pake Sicepat denga kualitas pengiriman yg sangat buruk, barang yg seharusnya dapat diterima on-time terpaksa harus mundur dan itu pun saya sendiri yg harus ambil ke ekspedisi. Mohon untuk dihapus aja pilihan kurir Sicepat sebab bukannya cepat malah lambat, sekian.",
    "review_text_normalized": "sorry harus kasih bintang karena kurir ekspedisi pake sicepat denga kualitas pengiriman yg sangat buruk barang yg seharusnya dapat diterima on time terpaksa harus mundur dan itu pun saya sendiri yg harus ambil ke ekspedisi mohon untuk dihapus aja pilihan kurir sicepat sebab bukannya cepat malah lambat sekian",
    "review_date": "10 bulan lalu",
    "review_date_normalized": "10 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 2,
    "scraped_at": "2025-07-16 22:35:46"
  },
  {
    "rating": 2,
    "reviewer_name": "N***d",
    "reviewer_name_normalized": "N d",
    "review_text": "gak lengkap aksesorisnya. gak ada pencil, gak ada mouse.",
    "review_text_normalized": "gak lengkap aksesorisnya gak ada pencil gak ada mouse",
    "review_date": "11 bulan lalu",
    "review_date_normalized": "11 bulan lalu",
    "variant": "Violet",
    "variant_normalized": "Violet",
    "rating_filter": 2,
    "scraped_at": "2025-07-16 22:35:48"
  },
  {
    "rating": 3,
    "reviewer_name": "E***o",
    "reviewer_name_normalized": "E o",
    "review_text": "pengemasan mengecewakan. dengan kemasan yg didalamnya berisi barang yang mudah rentan rusak dan bernilai 8 jta, pengemasan seolah olah asal asalan. gag tau dilayan jasa kirimnya yg kurang hati hati dan juga memang kardus luarnya kurang safety. dan kardus hp dalamnya juga penyok.mohon diperhatikan lagi dalam pengemasannya karena yg dikirim bukan",
    "review_text_normalized": "pengemasan mengecewakan dengan kemasan yg didalamnya berisi barang yang mudah rentan rusak dan bernilai jta pengemasan seolah olah asal asalan gag tau dilayan jasa kirimnya yg kurang hati hati dan juga memang kardus luarnya kurang safety dan kardus hp dalamnya juga penyok mohon diperhatikan lagi dalam pengemasannya karena yg dikirim bukan",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 3,
    "scraped_at": "2025-07-16 22:36:14"
  },
  {
    "rating": 3,
    "reviewer_name": "Aditiawarman",
    "reviewer_name_normalized": "Aditiawarman",
    "review_text": "barang masih segel, produk ori. cuman kemasannya apakah itu packingan dari huawei, atau di bongkar sama ekspedisi, packingnya penyok, rusak dan ada indikasi dibongkar dan dilakban ulang. tidak ada plastik yang melindungi barang.",
    "review_text_normalized": "barang masih segel produk ori cuman kemasannya apakah itu packingan dari huawei atau di bongkar sama ekspedisi packingnya penyok rusak dan ada indikasi dibongkar dan dilakban ulang tidak ada plastik yang melindungi barang",
    "review_date": "9 bulan lalu",
    "review_date_normalized": "9 bulan lalu",
    "variant": "Violet + EWS",
    "variant_normalized": "Violet EWS",
    "rating_filter": 3,
    "scraped_at": "2025-07-16 22:36:19"
  },
  {
    "rating": 3,
    "reviewer_name": "Bharata",
    "reviewer_name_normalized": "Bharata",
    "review_text": "Ada Baik nya Huawei official Store perbaiki cara paking yg Baik pake fragile stiker dan customer milih pengiriman reguler pake pesawat bukan dipindah kan ke trucking jg lama dan merusak paket nya. Terimakasih",
    "review_text_normalized": "ada baik nya huawei official store perbaiki cara paking yg baik pake fragile stiker dan customer milih pengiriman reguler pake pesawat bukan dipindah kan ke trucking jg lama dan merusak paket nya terimakasih",
    "review_date": "11 bulan lalu",
    "review_date_normalized": "11 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 3,
    "scraped_at": "2025-07-16 22:36:24"
  },
  {
    "rating": 3,
    "reviewer_name": "Kevin",
    "reviewer_name_normalized": "Kevin",
    "review_text": "Packing masih kurang untuk barang yang harganya lumayan mahal. Kualitas produk mantap. Jauh lebih baik daripada iPad pro keluaran 2023 dan ke bawah. Kualitas gambar jernih, warna teramat sangat akurat, dan speaker mantaps. Ada WPS Office PC Level yang eksklusif hanya ada di Huawei dan GoPaint yang sudah 11/12 dengan ProCreate. Sangat recommended untuk dijadikan tablet daily driver untuk pelajar maupun pekerja.",
    "review_text_normalized": "packing masih kurang untuk barang yang harganya lumayan mahal kualitas produk mantap jauh lebih baik daripada ipad pro keluaran dan ke bawah kualitas gambar jernih warna teramat sangat akurat dan speaker mantaps ada wps office pc level yang eksklusif hanya ada di huawei dan gopaint yang sudah dengan procreate sangat recommended untuk dijadikan tablet daily driver untuk pelajar maupun pekerja",
    "review_date": "9 bulan lalu",
    "review_date_normalized": "9 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 3,
    "scraped_at": "2025-07-16 22:36:30"
  },
  {
    "rating": 3,
    "reviewer_name": "Ratno",
    "reviewer_name_normalized": "Ratno",
    "review_text": "Biar toko dan tokopedia tau. Gini loh kualitas jasa bag pengiriman barang. (ongkir dibayar loh bukan gratis). Kasihan toko nya jika mesti retur dll. Urus komplain bs 1 bulan. Ini selisih dikit lagi kena tab nya. Pdhl packing udah pakai bubble loh. Bayangin brp parah jasa perpindahan barang.",
    "review_text_normalized": "biar toko dan tokopedia tau gini loh kualitas jasa bag pengiriman barang ongkir dibayar loh bukan gratis kasihan toko nya jika mesti retur dll urus komplain bs bulan ini selisih dikit lagi kena tab nya pdhl packing udah pakai bubble loh bayangin brp parah jasa perpindahan barang",
    "review_date": "12 bulan lalu",
    "review_date_normalized": "12 bulan lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 3,
    "scraped_at": "2025-07-16 22:36:35"
  },
  {
    "rating": 3,
    "reviewer_name": "Heri",
    "reviewer_name_normalized": "Heri",
    "review_text": "Pengemasan Wajib lebih Safety lagi, Sekelas HUAWEI Official Store, packing barang harga 8juta udah seperti packing barang harga 50ribu, Sangat rentan saat pengiriman, dus luar penyok dus dalam juga penyok.",
    "review_text_normalized": "pengemasan wajib lebih safety lagi sekelas huawei official store packing barang harga 8juta udah seperti packing barang harga 50ribu sangat rentan saat pengiriman dus luar penyok dus dalam juga penyok",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 3,
    "scraped_at": "2025-07-16 22:36:40"
  },
  {
    "rating": 3,
    "reviewer_name": "a***l",
    "reviewer_name_normalized": "a l",
    "review_text": "kurir rekomendasi tapi tdk di rekomendasikan. kecewa dgn kurir dan penjualnya. beli 2 barang di hari dan waktu yg hampir sama, tp pake 2 kurir beda. barang yg di bawah kurir jg penyok seperti gambar",
    "review_text_normalized": "kurir rekomendasi tapi tdk di rekomendasikan kecewa dgn kurir dan penjualnya beli barang di hari dan waktu yg hampir sama tp pake kurir beda barang yg di bawah kurir jg penyok seperti gambar",
    "review_date": "12 bulan lalu",
    "review_date_normalized": "12 bulan lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 3,
    "scraped_at": "2025-07-16 22:36:45"
  },
  {
    "rating": 3,
    "reviewer_name": "F***r",
    "reviewer_name_normalized": "F r",
    "review_text": "Barang hilang, dihilangin kurir, hindari penggunaan SiCepat, kualitas minus, maaf gak 5 bintang karena toko juga kurang baik dalam menangani komplain customer. Selain itu, dana refund ditahan oleh pihak Tokopedia tanpa ada kejelasan, tanggal penyelesaian proses di aplikasi tanggal 30 Juli, kemudian dijanjikan cair tanggal 1 Agustus, tapi sampai dengan saat ini belum juga ada cair itu uang saya. Gak terima barang, duit juga ditahan Tokopedia.",
    "review_text_normalized": "barang hilang dihilangin kurir hindari penggunaan sicepat kualitas minus maaf gak bintang karena toko juga kurang baik dalam menangani komplain customer selain itu dana refund ditahan oleh pihak tokopedia tanpa ada kejelasan tanggal penyelesaian proses di aplikasi tanggal juli kemudian dijanjikan cair tanggal agustus tapi sampai dengan saat ini belum juga ada cair itu uang saya gak terima barang duit juga ditahan tokopedia",
    "review_date": "11 bulan lalu",
    "review_date_normalized": "11 bulan lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 3,
    "scraped_at": "2025-07-16 22:36:50"
  },
  {
    "rating": 3,
    "reviewer_name": "G***y",
    "reviewer_name_normalized": "G y",
    "review_text": "packagingnya parah amat, dri pihak kurir klaim kalo packagingnya udh terbuka untungnya udh di klarifikasi lewat video sm kurirnya klo barangnya aman dan lengkap tolong diperbaiki lagi packagingnya kalo dikirim ke luar pulau bahaya bisa hilang atau rusak",
    "review_text_normalized": "packagingnya parah amat dri pihak kurir klaim kalo packagingnya udh terbuka untungnya udh di klarifikasi lewat video sm kurirnya klo barangnya aman dan lengkap tolong diperbaiki lagi packagingnya kalo dikirim ke luar pulau bahaya bisa hilang atau rusak",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Spcae Grey+EWS",
    "variant_normalized": "Spcae Grey EWS",
    "rating_filter": 3,
    "scraped_at": "2025-07-16 22:36:56"
  },
  {
    "rating": 3,
    "reviewer_name": "Anggara",
    "reviewer_name_normalized": "Anggara",
    "review_text": "Plus - gambar tajem - build quality sesuai harganya, bagus - bonus pencil & detachable keyboard - packing lumayan aman - cocok bagi designer, yg suka gambar , tablet versi papermatte nyaman Minus - device huawei matepad menerapkan system spoofing, device matepad akan terdeteksi oleh google menjadi oppo & lain\" ketika login dengan akun google kalian - banyak bug di apps & system Karena ini bukan android, & service pake huawei punya. Jadi gak disarankan bagi yg newbie di tech, karena butuh waktu buat penyesuaian - akses ke aplikasi terbatas, karena gak terhubung langsung dengan playstore - update os yg terbatas - butuh effort buat setting, karena system yy beda dari android & apps nya yg sering ngebug - minim resource official buat research semisal ada bugs, jadi harus ke cs huawei Jujur ada sedikit rasa kecewa, karena ngira bakal dynamis dan bagus system dari huawei. Tapi ngerasa kaya jadi user beta devicenya. Its ok, experience tablet nya buat kerja lumayan ngebantu juga.",
    "review_text_normalized": "plus gambar tajem build quality sesuai harganya bagus bonus pencil detachable keyboard packing lumayan aman cocok bagi designer yg suka gambar tablet versi papermatte nyaman minus device huawei matepad menerapkan system spoofing device matepad akan terdeteksi oleh google menjadi oppo lain ketika login dengan akun google kalian banyak bug di apps system karena ini bukan android service pake huawei punya jadi gak disarankan bagi yg newbie di tech karena butuh waktu buat penyesuaian akses ke aplikasi terbatas karena gak terhubung langsung dengan playstore update os yg terbatas butuh effort buat setting karena system yy beda dari android apps nya yg sering ngebug minim resource official buat research semisal ada bugs jadi harus ke cs huawei jujur ada sedikit rasa kecewa karena ngira bakal dynamis dan bagus system dari huawei tapi ngerasa kaya jadi user beta devicenya its ok experience tablet nya buat kerja lumayan ngebantu juga",
    "review_date": "9 bulan lalu",
    "review_date_normalized": "9 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 3,
    "scraped_at": "2025-07-16 22:37:01"
  },
  {
    "rating": 3,
    "reviewer_name": "v***n",
    "reviewer_name_normalized": "v n",
    "review_text": "packing luarnya sembarangan... kurang profesional.",
    "review_text_normalized": "packing luarnya sembarangan kurang profesional",
    "review_date": "11 bulan lalu",
    "review_date_normalized": "11 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 3,
    "scraped_at": "2025-07-16 22:37:13"
  },
  {
    "rating": 3,
    "reviewer_name": "Vincent",
    "reviewer_name_normalized": "Vincent",
    "review_text": "10 bulan lalu\nVincent\nVarian: Spcae Grey+EWS\nKendala: Tidak lengkap/salah kirim\n1 orang terbantu\nLihat Balasan",
    "review_text_normalized": "bulan lalu vincent varian spcae greyews kendala tidak lengkap salah kirim orang terbantu lihat balasan",
    "review_date": "10 bulan lalu",
    "review_date_normalized": "10 bulan lalu",
    "variant": "Spcae Grey+EWS",
    "variant_normalized": "Spcae Grey EWS",
    "rating_filter": 3,
    "scraped_at": "2025-07-16 22:37:14"
  },
  {
    "rating": 3,
    "reviewer_name": "P***I",
    "reviewer_name_normalized": "P I",
    "review_text": "Lebih dari 1 tahun lalu\nP***I\nVarian: Violet+Proteksi\nKendala: Kemasan tidak aman, Pengiriman lama\nMembantu\nLihat Balasan",
    "review_text_normalized": "lebih dari tahun lalu p i varian violetproteksi kendala kemasan tidak aman pengiriman lama membantu lihat balasan",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Violet+Proteksi",
    "variant_normalized": "Violet Proteksi",
    "rating_filter": 3,
    "scraped_at": "2025-07-16 22:37:16"
  },
  {
    "rating": 3,
    "reviewer_name": "A***C",
    "reviewer_name_normalized": "A C",
    "review_text": ".",
    "review_text_normalized": "",
    "review_date": "8 bulan lalu",
    "review_date_normalized": "8 bulan lalu",
    "variant": "Spcae Grey+EWS",
    "variant_normalized": "Spcae Grey EWS",
    "rating_filter": 3,
    "scraped_at": "2025-07-16 22:37:18"
  },
  {
    "rating": 4,
    "reviewer_name": "Budhi",
    "reviewer_name_normalized": "Budhi",
    "review_text": "Barang masih segel, tetapi kotak pengiriman penyok parah sehingga kena kotak barang jd ikut penyok. Semoga isinya aman",
    "review_text_normalized": "barang masih segel tetapi kotak pengiriman penyok parah sehingga kena kotak barang jd ikut penyok semoga isinya aman",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Spcae Grey+EWS",
    "variant_normalized": "Spcae Grey EWS",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:37:56"
  },
  {
    "rating": 4,
    "reviewer_name": "f***h",
    "reviewer_name_normalized": "f h",
    "review_text": "pengiriman lama kerdusnya ga berbentuk tapi aman barang oke original asli no kw kw",
    "review_text_normalized": "pengiriman lama kerdusnya ga berbentuk tapi aman barang oke original asli no kw kw",
    "review_date": "12 bulan lalu",
    "review_date_normalized": "12 bulan lalu",
    "variant": "Violet",
    "variant_normalized": "Violet",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:37:58"
  },
  {
    "rating": 4,
    "reviewer_name": "Bung",
    "reviewer_name_normalized": "Bung",
    "review_text": "kondisi barang saat sampai sangat lengkap, baik, dan aman. cuman waktu PO nya aja agak lama, tapi syukurnya saya pilih pengiriman yg tepat, barang sampai dengan cepat akhirnya. terima kasih huawei",
    "review_text_normalized": "kondisi barang saat sampai sangat lengkap baik dan aman cuman waktu po nya aja agak lama tapi syukurnya saya pilih pengiriman yg tepat barang sampai dengan cepat akhirnya terima kasih huawei",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Spcae Grey+EWS",
    "variant_normalized": "Spcae Grey EWS",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:38:03"
  },
  {
    "rating": 4,
    "reviewer_name": "R***d",
    "reviewer_name_normalized": "R d",
    "review_text": "Barang bagus, packaging jelek. Dus barang didalamnya sdkt penyok, untungnya dus bawaan huawei tebal. Mohon utk penjual memperhatikan nya apalagi ini toko official",
    "review_text_normalized": "barang bagus packaging jelek dus barang didalamnya sdkt penyok untungnya dus bawaan huawei tebal mohon utk penjual memperhatikan nya apalagi ini toko official",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:38:05"
  },
  {
    "rating": 4,
    "reviewer_name": "i***n",
    "reviewer_name_normalized": "i n",
    "review_text": "Produk gaada masalah, bagus.. Cuma ngacoo banget packingnya cok, kardus tipis, jeleeek, gak niat packing Packing harga jutaan kalah sm barang 200rb an",
    "review_text_normalized": "produk gaada masalah bagus cuma ngacoo banget packingnya cok kardus tipis jeleeek gak niat packing packing harga jutaan kalah sm barang 200rb an",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Spcae Grey+EWS",
    "variant_normalized": "Spcae Grey EWS",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:38:06"
  },
  {
    "rating": 4,
    "reviewer_name": "A***D",
    "reviewer_name_normalized": "A D",
    "review_text": "luar biasa tidak aman packing barangnya, luarbiasa juga kurirnya sicepat yg super lambat dan sampai paketnya sepenyok ini, sampai segelnya terbuka. untung barang di dalamnya masih aman",
    "review_text_normalized": "luar biasa tidak aman packing barangnya luarbiasa juga kurirnya sicepat yg super lambat dan sampai paketnya sepenyok ini sampai segelnya terbuka untung barang di dalamnya masih aman",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:38:12"
  },
  {
    "rating": 4,
    "reviewer_name": "F***i",
    "reviewer_name_normalized": "F i",
    "review_text": "Barang datang lebih cepat dari yang seharusnya namun kondisi kardus terbuka, lakban dan sticker tidak lengket sempurna sangat berbahaya apalagi ada tulisan huaweinya",
    "review_text_normalized": "barang datang lebih cepat dari yang seharusnya namun kondisi kardus terbuka lakban dan sticker tidak lengket sempurna sangat berbahaya apalagi ada tulisan huaweinya",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Violet+Proteksi",
    "variant_normalized": "Violet Proteksi",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:38:13"
  },
  {
    "rating": 4,
    "reviewer_name": "S***o",
    "reviewer_name_normalized": "S o",
    "review_text": "Saya kecewa dengan packing yang tidak rapat dan rapi. Saat paket saya terima, kondisinya bungkus luarnya rusak. bungkus luar yg rusak pasti membuat kawatir kondisi barang di dalamnya. Mohon lain kali lebih memperhatikan PACKAGING luar mengingat ini BUKAN barang MURAH.",
    "review_text_normalized": "saya kecewa dengan packing yang tidak rapat dan rapi saat paket saya terima kondisinya bungkus luarnya rusak bungkus luar yg rusak pasti membuat kawatir kondisi barang di dalamnya mohon lain kali lebih memperhatikan packaging luar mengingat ini bukan barang murah",
    "review_date": "12 bulan lalu",
    "review_date_normalized": "12 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:38:18"
  },
  {
    "rating": 4,
    "reviewer_name": "l***e",
    "reviewer_name_normalized": "l e",
    "review_text": "barang bagus, oke. tapi untuk packing barang mohon diperhatikan kembali. sekelas huawei & official store menurut saya kurang sekali untuk pengemasan barangnya. semoga bisa ditingkatkan",
    "review_text_normalized": "barang bagus oke tapi untuk packing barang mohon diperhatikan kembali sekelas huawei official store menurut saya kurang sekali untuk pengemasan barangnya semoga bisa ditingkatkan",
    "review_date": "11 bulan lalu",
    "review_date_normalized": "11 bulan lalu",
    "variant": "Violet+Proteksi",
    "variant_normalized": "Violet Proteksi",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:38:23"
  },
  {
    "rating": 4,
    "reviewer_name": "A***d",
    "reviewer_name_normalized": "A d",
    "review_text": "barang ori dan bonusnya mantap.. enak dipakai dan smooth.. layar lembut di mata dan speakernya mantab.. sayang utk hrg segitu kameranya hrsnya bs lbh baik lg.. kondisi agak gelap dikit aja sangat grainy kyk tab china murmer dan baterenya gak seawet yg kukira",
    "review_text_normalized": "barang ori dan bonusnya mantap enak dipakai dan smooth layar lembut di mata dan speakernya mantab sayang utk hrg segitu kameranya hrsnya bs lbh baik lg kondisi agak gelap dikit aja sangat grainy kyk tab china murmer dan baterenya gak seawet yg kukira",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Violet+Proteksi",
    "variant_normalized": "Violet Proteksi",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:38:29"
  },
  {
    "rating": 4,
    "reviewer_name": "M***r",
    "reviewer_name_normalized": "M r",
    "review_text": "Permasalahan emang dipackingan kurang aman, kalau mau beli laptop sedikit ragu",
    "review_text_normalized": "permasalahan emang dipackingan kurang aman kalau mau beli laptop sedikit ragu",
    "review_date": "12 bulan lalu",
    "review_date_normalized": "12 bulan lalu",
    "variant": "Violet",
    "variant_normalized": "Violet",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:38:41"
  },
  {
    "rating": 4,
    "reviewer_name": "I***n",
    "reviewer_name_normalized": "I n",
    "review_text": "Barang sudah sampai. tapi dus nya sudah bolong2 ya. ngeri2 sedap euy packing nya.. tp kondisi kelengkapan kumplit dan tidak ada kendala.",
    "review_text_normalized": "barang sudah sampai tapi dus nya sudah bolong2 ya ngeri2 sedap euy packing nya tp kondisi kelengkapan kumplit dan tidak ada kendala",
    "review_date": "11 bulan lalu",
    "review_date_normalized": "11 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:38:42"
  },
  {
    "rating": 4,
    "reviewer_name": "Azmi",
    "reviewer_name_normalized": "Azmi",
    "review_text": "packing mohon untuk lebih safety lagi",
    "review_text_normalized": "packing mohon untuk lebih safety lagi",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:38:44"
  },
  {
    "rating": 4,
    "reviewer_name": "H***o",
    "reviewer_name_normalized": "H o",
    "review_text": "Dus nya tipis amat. Sampai disini udah penyok dan robek. Sampai box tablet nga juga ikutan penyok. Tolong lah sekelas official store huawei koq kualitas packing sampai segitux.",
    "review_text_normalized": "dus nya tipis amat sampai disini udah penyok dan robek sampai box tablet nga juga ikutan penyok tolong lah sekelas official store huawei koq kualitas packing sampai segitux",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:38:49"
  },
  {
    "rating": 4,
    "reviewer_name": "R***t",
    "reviewer_name_normalized": "R t",
    "review_text": "Barang sudah sampai dengan aman, hanya saja ternyata tidak termasuk Pen. Kalo mau beli pen dijual terpisah, dan tidak dicantumkan di deskripsi.",
    "review_text_normalized": "barang sudah sampai dengan aman hanya saja ternyata tidak termasuk pen kalo mau beli pen dijual terpisah dan tidak dicantumkan di deskripsi",
    "review_date": "10 bulan lalu",
    "review_date_normalized": "10 bulan lalu",
    "variant": "Violet",
    "variant_normalized": "Violet",
    "rating_filter": 4,
    "scraped_at": "2025-07-16 22:38:51"
  },
  {
    "rating": 5,
    "reviewer_name": "Dimas",
    "reviewer_name_normalized": "Dimas",
    "review_text": "Barang sesuai pesanan, dapat bonus Mpencil dan keyboard sesuai di foto, pengiriman cepat, berfungsi dengan baik, desain keren dan fitur sangat keren, tab terbaik dengan harga yg oke. dapat diskon lumayan waktu 10.10, mantap",
    "review_text_normalized": "barang sesuai pesanan dapat bonus mpencil dan keyboard sesuai di foto pengiriman cepat berfungsi dengan baik desain keren dan fitur sangat keren tab terbaik dengan harga yg oke dapat diskon lumayan waktu mantap",
    "review_date": "9 bulan lalu",
    "review_date_normalized": "9 bulan lalu",
    "variant": "Violet",
    "variant_normalized": "Violet",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:39:17"
  },
  {
    "rating": 5,
    "reviewer_name": "H***y",
    "reviewer_name_normalized": "H y",
    "review_text": "barang original, berfungsi baik, lengkap, pengiriman sesuai. mate tidak ada pantulan cahaya, namun paperlike feelnya agak kurang terasa",
    "review_text_normalized": "barang original berfungsi baik lengkap pengiriman sesuai mate tidak ada pantulan cahaya namun paperlike feelnya agak kurang terasa",
    "review_date": "9 bulan lalu",
    "review_date_normalized": "9 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:39:19"
  },
  {
    "rating": 5,
    "reviewer_name": "D***s",
    "reviewer_name_normalized": "D s",
    "review_text": "barang aman sampai tujuan. masih segel dan dpt keyboard. sayang ga dapat mouse dan pen",
    "review_text_normalized": "barang aman sampai tujuan masih segel dan dpt keyboard sayang ga dapat mouse dan pen",
    "review_date": "4 bulan lalu",
    "review_date_normalized": "4 bulan lalu",
    "variant": "Violet",
    "variant_normalized": "Violet",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:39:20"
  },
  {
    "rating": 5,
    "reviewer_name": "T***I",
    "reviewer_name_normalized": "T I",
    "review_text": "Barang bagus dan tersegel, fast respon, tapi mengapa tak de pensil bonusnya ya. Mana di storenya kosong.",
    "review_text_normalized": "barang bagus dan tersegel fast respon tapi mengapa tak de pensil bonusnya ya mana di storenya kosong",
    "review_date": "7 bulan lalu",
    "review_date_normalized": "7 bulan lalu",
    "variant": "Spcae Grey+EWS",
    "variant_normalized": "Spcae Grey EWS",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:39:22"
  },
  {
    "rating": 5,
    "reviewer_name": "Aldi",
    "reviewer_name_normalized": "Aldi",
    "review_text": "produk original dan semua berfungsi dengan baik. PO tidak sampai 11 hari sudah terkirim. mantap",
    "review_text_normalized": "produk original dan semua berfungsi dengan baik po tidak sampai hari sudah terkirim mantap",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:39:24"
  },
  {
    "rating": 5,
    "reviewer_name": "Heru",
    "reviewer_name_normalized": "Heru",
    "review_text": "Tablet yang bonusnya melimpah, ada huawei m pencil gen 3, ada official keyboard case, dan ada huawei wireless mousenya. Cocok dibeli saat masa pre order. Adanya Go Paint mempengaruhi daya jual tablet ini. Waktunya belajar bikin digital art dan berkreasi. Packingnya juga aman dan pengirimannya sesuai dengan yang dijanjikan.",
    "review_text_normalized": "tablet yang bonusnya melimpah ada huawei m pencil gen ada official keyboard case dan ada huawei wireless mousenya cocok dibeli saat masa pre order adanya go paint mempengaruhi daya jual tablet ini waktunya belajar bikin digital art dan berkreasi packingnya juga aman dan pengirimannya sesuai dengan yang dijanjikan",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Grey+Proteksi",
    "variant_normalized": "Grey Proteksi",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:39:29"
  },
  {
    "rating": 5,
    "reviewer_name": "Richardo",
    "reviewer_name_normalized": "Richardo",
    "review_text": "Sempat kuatir dengan kondisi kardus Coklat yg penyok dan Kardus Tabletnya yang warna putih. tetapi setelah dicek kondisi Tablet dalam kondisi baik. mohon di perhatikan kembali. Dan sekarang dalam masa penyesuaian, keseluruhan dengan Tablet sangat kagum. Terimakasih Huawei",
    "review_text_normalized": "sempat kuatir dengan kondisi kardus coklat yg penyok dan kardus tabletnya yang warna putih tetapi setelah dicek kondisi tablet dalam kondisi baik mohon di perhatikan kembali dan sekarang dalam masa penyesuaian keseluruhan dengan tablet sangat kagum terimakasih huawei",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Violet + EWS",
    "variant_normalized": "Violet EWS",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:39:34"
  },
  {
    "rating": 5,
    "reviewer_name": "Luna",
    "reviewer_name_normalized": "Luna",
    "review_text": "barang tersegel dengan rapi walaupun kardus luar penyok. Alhamdulillah laptop aman .warna purple nya cantik banget. berfungsi dengan baik.pokoknya puas belanja disini.terimakasih. admin juga gercep jawab chat.",
    "review_text_normalized": "barang tersegel dengan rapi walaupun kardus luar penyok alhamdulillah laptop aman warna purple nya cantik banget berfungsi dengan baik pokoknya puas belanja disini terimakasih admin juga gercep jawab chat",
    "review_date": "8 bulan lalu",
    "review_date_normalized": "8 bulan lalu",
    "variant": "Violet",
    "variant_normalized": "Violet",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:39:39"
  },
  {
    "rating": 5,
    "reviewer_name": "M***d",
    "reviewer_name_normalized": "M d",
    "review_text": "Barangnya Bagus Seller Ramah dan Responsive Packing Aman Semuanya Oke",
    "review_text_normalized": "barangnya bagus seller ramah dan responsive packing aman semuanya oke",
    "review_date": "9 bulan lalu",
    "review_date_normalized": "9 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:39:41"
  },
  {
    "rating": 5,
    "reviewer_name": "A***a",
    "reviewer_name_normalized": "A a",
    "review_text": "Dapat harga gooddeal pas 10.10. Udah ngincer lumayan lama, pas tau diskonnya lumayan lngsg gas checkout. So far ini tab paling value for money buat saat ini, udh complete dpt keyboard dan pen. Magnetnya kenceng bgt juga buat berdiriin tabnya diatas keyboard. Yg masih worry klo ini gbs google dll, gak ya ini bisa kok buat aplikasi google dan tetek bengek lainnya. Mantap huawei pantes si apel ketar ketir hehehe",
    "review_text_normalized": "dapat harga gooddeal pas udah ngincer lumayan lama pas tau diskonnya lumayan lngsg gas checkout so far ini tab paling value for money buat saat ini udh complete dpt keyboard dan pen magnetnya kenceng bgt juga buat berdiriin tabnya diatas keyboard yg masih worry klo ini gbs google dll gak ya ini bisa kok buat aplikasi google dan tetek bengek lainnya mantap huawei pantes si apel ketar ketir hehehe",
    "review_date": "9 bulan lalu",
    "review_date_normalized": "9 bulan lalu",
    "variant": "Space Grey",
    "variant_normalized": "Space Grey",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:39:46"
  },
  {
    "rating": 5,
    "reviewer_name": "Fachry",
    "reviewer_name_normalized": "Fachry",
    "review_text": "barang sudah sampai. pengiriman cepat. aman terkendali. free nya hanya keyboard saja. tanpa ada mouse dan mpensil.. musti beli terpisah sih. agak repot jadinya.. beli lagi . pakai enggak cumplitt",
    "review_text_normalized": "barang sudah sampai pengiriman cepat aman terkendali free nya hanya keyboard saja tanpa ada mouse dan mpensil musti beli terpisah sih agak repot jadinya beli lagi pakai enggak cumplitt",
    "review_date": "4 minggu lalu",
    "review_date_normalized": "4 minggu lalu",
    "variant": "Spcae Grey+EWS",
    "variant_normalized": "Spcae Grey EWS",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:40:02"
  },
  {
    "rating": 5,
    "reviewer_name": "D***z",
    "reviewer_name_normalized": "D z",
    "review_text": "Seller ramah dan infrormatif juga fast respon, thank you",
    "review_text_normalized": "seller ramah dan infrormatif juga fast respon thank you",
    "review_date": "Lebih dari 1 tahun lalu",
    "review_date_normalized": "Lebih dari 1 tahun lalu",
    "variant": "Violet",
    "variant_normalized": "Violet",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:40:03"
  },
  {
    "rating": 5,
    "reviewer_name": "Kristanto",
    "reviewer_name_normalized": "Kristanto",
    "review_text": "Barang Bagus, Semoga Awet pemakaian nya dan tidak ada kendala ke depannya",
    "review_text_normalized": "barang bagus semoga awet pemakaian nya dan tidak ada kendala ke depannya",
    "review_date": "8 bulan lalu",
    "review_date_normalized": "8 bulan lalu",
    "variant": "Spcae Grey+EWS",
    "variant_normalized": "Spcae Grey EWS",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:40:05"
  },
  {
    "rating": 5,
    "reviewer_name": "Saiful",
    "reviewer_name_normalized": "Saiful",
    "review_text": "Barang sampai dengan aman, selamat, dan cepat. Sudah pasti ori dan berfungsi dengan baik. Kualitas layar yang nyaman di mata, semoga bisa meningkatkan produktivitas",
    "review_text_normalized": "barang sampai dengan aman selamat dan cepat sudah pasti ori dan berfungsi dengan baik kualitas layar yang nyaman di mata semoga bisa meningkatkan produktivitas",
    "review_date": "9 bulan lalu",
    "review_date_normalized": "9 bulan lalu",
    "variant": "Violet + EWS",
    "variant_normalized": "Violet EWS",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:40:06"
  },
  {
    "rating": 5,
    "reviewer_name": "D***y",
    "reviewer_name_normalized": "D y",
    "review_text": "produk terjamin ori, admin sangat responsif. sejauh ini sudah di tes 2 hari oke no prob.. namun untuk papermatte edition yg tergolong unik ini tidak dapat bonus m-pen hanya keyboard aja. harus beli terpisah",
    "review_text_normalized": "produk terjamin ori admin sangat responsif sejauh ini sudah di tes hari oke no prob namun untuk papermatte edition yg tergolong unik ini tidak dapat bonus m pen hanya keyboard aja harus beli terpisah",
    "review_date": "7 bulan lalu",
    "review_date_normalized": "7 bulan lalu",
    "variant": "Violet",
    "variant_normalized": "Violet",
    "rating_filter": 5,
    "scraped_at": "2025-07-16 22:40:12"
  }
]